Platform/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" INNER JOIN "enrollments" ON "enrollments"."course_id" = "courses"."id" GROUP BY "courses"."id" ORDER BY COUNT(enrollments.id) DESC LIMIT $1  [["LIMIT", 5]]
---
  def index
    @courses = Course.all
    # Get the most popular courses (top 5 based on enrollments)
    @popular_courses = Course.joins(:enrollments)
                              .group("courses.id")
                              .order("COUNT(enrollments.id) DESC")
                              .limit(5)

UPDATE "courses" SET "user_id" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["user_id", 4], ["updated_at", "2024-11-14 12:24:38.027527"], ["id", 2]]
---
  def update
    if @course.update(course_params)