Platform/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (created_at >= $1) ORDER BY "courses"."created_at" DESC  [[nil, "2024-11-07 14:58:34.852537"]]
---
  def index
    @courses = Course.all # Fetch all courses

SELECT "users".* FROM "users"
---
  def new
    @course = Course.new
    @teachers = User.all

INSERT INTO "courses" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mastering Python for Data Science"], ["description", nil], ["user_id", 3], ["created_at", "2024-11-05 20:35:08.921633"], ["updated_at", "2024-11-05 20:35:08.921633"]]
---
  def create
    @course = Course.new(course_params)
    @course.user_id = current_user.id
    if @course.save

UPDATE "courses" SET "updated_at" = $1 WHERE "courses"."id" = $2  [["updated_at", "2024-11-14 13:43:00.801335"], ["id", 3]]
---
  def update
    if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "courses" WHERE "courses"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
---
  def enroll
    @course = Course.find(params[:id])
    current_user.courses << @course unless current_user.courses.include?(@course)