Platform/app/controllers/lessons_controller.rb

  def create
    @lesson = @course.lessons.new(lesson_params)
    if @lesson.save
---
INSERT INTO "lessons" ("title", "content", "course_id", "lesson_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "updated_at" = $1 WHERE "lessons"."id" = $2  [["updated_at", "2024-11-14 13:36:49.746780"], ["id", 4]]

  def set_course
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def set_lesson
    @lesson = @course.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1 AND "lessons"."id" = $2 LIMIT $3  [["course_id", 2], ["id", 3], ["LIMIT", 1]]

  def ensure_enrolled
    unless current_user.enrolled_courses.include?(@course) || @course.teacher == current_user
---
SELECT 1 AS one FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]