Platform/app/views/courses/index.html.erb

SELECT "courses".* FROM "courses" WHERE (created_at >= $1) ORDER BY "courses"."created_at" DESC  [[nil, "2024-11-07 14:58:34.852537"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 3], ["LIMIT", 1]]
---
            <% if user_signed_in? %>
              <% if current_user != course.user && !current_user.enrolled_courses.include?(course) %>
                <%= button_to 'Enroll', enroll_course_path(course), method: :post, class: 'btn btn-success' %>
              <% elsif current_user.enrolled_courses.include?(course) %>