Platform/app/views/courses/my_courses.html.erb

              <h5 class="card-title"><%= course.title %></h5>
              <% if current_user.enrolled_courses.include?(course) %>
---
SELECT 1 AS one FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1  [["user_id", 4]]