Platform/app/views/courses/show.html.erb

SELECT "courses"."id" FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = $1  [["user_id", 3]]
---

  <% if current_user.enrolled_courses.include?(@course) && @enrollment %>

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 2]]
---
  <div class="row">
    <% @course.lessons.each do |lesson| %>