Platform/app/views/lessons/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <p>
          <strong><%= question.user.first_name %> <%= question.user.last_name %> (<%= question.user.email %>)</strong> asked: